[
  {
    "type": "h1",
    "content": "Rules"
  },
  {
    "type": "p",
    "content": "Please familiarize yourself with the below rules that apply throughout the entire duration of Prosperity. Happy Trading!"
  },
  {
    "type": "h2",
    "content": "Game Participation Rules"
  },
  {
    "type": "p",
    "content": "To ensure a smooth experience during Prosperity, here are a few important guidelines regarding team participation and solo play:"
  },
  {
    "type": "p",
    "content": "Create an Account → You can register and join the game anytime until the end of Round 5."
  },
  {
    "type": "p",
    "content": "Join a New Team → Team formation is open until the end of Round 2."
  },
  {
    "type": "p",
    "content": "Switch Teams → You can switch teams until the end of Round 2. Switching teams is done by receiving an invitation link from the new team’s admin. If you accept an invite to a new team, you will automatically resign from your current one."
  },
  {
    "type": "p",
    "content": "Start a Solo Player Island → Prefer to go solo? You can start your own island anytime until the end of Round 5."
  },
  {
    "type": "p",
    "content": "Please note that the Prosperity organization / admin board will not accommodate manually moving players from one team to the other at any point during the duration of the game."
  },
  {
    "type": "h2",
    "content": "Behavior on Discord"
  },
  {
    "type": "p",
    "content": "To ensure Prosperity remains a respectful and enjoyable experience for everyone, we expect all participants to follow proper conduct on Discord and in the game."
  },
  {
    "type": "p",
    "content": "Respect all participants – Keep discussions constructive and inclusive. Healthy competition is encouraged, but toxicity, harassment, or discrimination will not be tolerated."
  },
  {
    "type": "p",
    "content": "Follow Discord rules & etiquette – No spamming, offensive language, or inappropriate behavior."
  },
  {
    "type": "p",
    "content": "Moderation – Repeated violations will trigger warnings, temporary mutes, or bans. Failure to adhere to these rules may result in removal from the Discord server and potentially the game. Let’s create a positive environment for everyone! If you experience any issues, please contact a moderator."
  }
]